app/views/diretorios/show.html.erb


<!--  Diretorio.find(DiretoriosMapa.where(child: @diretorio.id)[:parent])-->
---
SELECT "diretorios_mapas".* FROM "diretorios_mapas" WHERE "diretorios_mapas"."child" = ?  [["child", 41530848]]


      <% DiretoriosMapa.where(parent: @diretorio.id).each do |diretorios_in_selected_diretorio| %>
        <%= render Diretorio.where(id: diretorios_in_selected_diretorio.child) %>
---
SELECT "diretorios_mapas".* FROM "diretorios_mapas" WHERE "diretorios_mapas"."parent" = ?  [["parent", 41530848]]
SELECT "diretorios".* FROM "diretorios" WHERE "diretorios"."id" = ?  [["id", 1161811974425093224]]