app/views/diretorios/show.html.erb

INSERT INTO "diretorios" ("name", "path", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "root"], ["path", "/"], ["created_at", "2022-10-29 04:57:45.549565"], ["updated_at", "2022-10-29 04:57:45.549565"]]
---
  <strong>Data Criação: </strong>
  <%= @diretorio.created_at.strftime("%d/%m/%y") %>

SELECT "diretorios_mapas".* FROM "diretorios_mapas" WHERE "diretorios_mapas"."parent" = ?  [["parent", 41530848]]
SELECT "diretorios".* FROM "diretorios" WHERE "diretorios"."id" = ?  [["id", 41530848]]
---

      <% DiretoriosMapa.where(parent: @diretorio.id).each do |diretorios_in_selected_diretorio| %>
        <%= render Diretorio.where(id: diretorios_in_selected_diretorio.child) %>