app/views/welcome/index.html.erb

      <% DiretoriosMapa.where(parent: Diretorio.where(name: 'root').ids[0]).each do |diretorio_in_root| %>
        <%= render Diretorio.where(id: diretorio_in_root.child) %>
---
SELECT "diretorios".* FROM "diretorios" WHERE "diretorios"."id" = ?  [["id", 41530848]]