app/controllers/diretorios_controller.rb

  def delete_diretorio
    Diretorio.destroy(params[:id])
---
DELETE FROM "diretorios" WHERE "diretorios"."id" = ?  [["id", 1]]