app/controllers/diretorios_controller.rb

  def index
    @diretorios = Diretorio.where.not(name: 'root')
---
SELECT "diretorios".* FROM "diretorios" WHERE "diretorios"."name" != ?  [["name", "root"]]

  def new
    @diretorio = Diretorio.new
    @diretorios = Diretorio.all
---
SELECT "diretorios".* FROM "diretorios"

  def create
    @diretorio = Diretorio.new(diretorio_params)

    respond_to do |format|
      if @diretorio.save
        @diretorio_mapa = DiretoriosMapa.new({:parent => params[:diretorio][:parent_ID], :child => @diretorio.id})
        if @diretorio_mapa.save
          format.html { redirect_to diretorio_url(Diretorio.find(params[:diretorio][:parent_ID])), notice: "Diretorio foi criado com sucesso." }
          format.json { render :show, status: :created, location: @diretorio }
        end
      else
        @diretorios = Diretorio.all
---
INSERT INTO "diretorios" ("name", "path", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "reberbrebe"], ["path", "/root/Administração"], ["created_at", "2022-10-25 11:26:54.056388"], ["updated_at", "2022-10-25 11:26:54.056388"]]
INSERT INTO "diretorios_mapas" ("parent", "child", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["parent", 41530848], ["child", 1161811974425093225], ["created_at", "2022-10-25 11:31:51.311758"], ["updated_at", "2022-10-25 11:31:51.311758"]]
INSERT INTO "diretorios" ("name", "path", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fwefwefwefw"], ["path", "/root/Administração"], ["created_at", "2022-10-25 10:58:08.711221"], ["updated_at", "2022-10-25 10:58:08.711221"]]
SELECT "diretorios".* FROM "diretorios" WHERE "diretorios"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "diretorios".* FROM "diretorios"

  def update
    respond_to do |format|
      if @diretorio.update(diretorio_params)
---
UPDATE "diretorios" SET "name" = ?, "path" = ?, "updated_at" = ? WHERE "diretorios"."id" = ?  [["name", "Teste 4"], ["path", "///root"], ["updated_at", "2022-10-24 22:39:17.012070"], ["id", 1161811974425093182]]

  def destroy
    @diretorio.destroy
---
DELETE FROM "diretorios" WHERE "diretorios"."id" = ?  [["id", 1161811974425093183]]

    def set_diretorio
      @diretorio = Diretorio.find(params[:id])
---
SELECT "diretorios".* FROM "diretorios" WHERE "diretorios"."id" = ? LIMIT ?  [["id", 41530848], ["LIMIT", 1]]