app/controllers/registrations_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "abc"], ["email", "emailteste@gmail.com"], ["password", "123"], ["created_at", "2022-10-17 15:31:31.068951"], ["updated_at", "2022-10-17 15:31:31.068951"]]
---
def loginTest
  @User = User.new
  user = User.find_by(email: 'teste@gmail.com')
  if !user.present?
    @user = User.new(name: 'Teste', email: 'teste@gmail.com', password: '1234').save!

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "abc"], ["email", "emailteste@gmail.com"], ["password", "123"], ["created_at", "2022-10-17 15:31:31.068951"], ["updated_at", "2022-10-17 15:31:31.068951"]]
---
def create
  @User = User.new(user_params)
  if @User.save