app/models/diretorios_mapa.rb

SELECT "diretorios_mapas".* FROM "diretorios_mapas" WHERE "diretorios_mapas"."child" = ? LIMIT ?  [["child", 41530848], ["LIMIT", 1]]
SELECT "diretorios".* FROM "diretorios" WHERE "diretorios"."id" = ?  [["id", 41530848]]
---
  def get_parent_directory(directory_id)
    if directory_id == Diretorio.new.get_root_directory_id
      Diretorio.new.get_root_directory
    else
      @diretorio_mapa = DiretoriosMapa.find_by(child: directory_id)

      if @diretorio_mapa != nil
        return Diretorio.where(id: @diretorio_mapa[:parent])[0]