app/models/diretorio.rb

  def get_root_directory_id
    Diretorio.where(name: 'root').ids[0]
---
SELECT "diretorios"."id" FROM "diretorios" WHERE "diretorios"."name" = ?  [["name", "root"]]

  def get_root_directory
    Diretorio.find(get_root_directory_id)
---
SELECT "diretorios".* FROM "diretorios" WHERE "diretorios"."id" = ? LIMIT ?  [["id", 1161811974425093174], ["LIMIT", 1]]